StefanSpa/lpc21isp/lpcprog.c
/******************************************************************************

Project:           Portable command line ISP for NXP LPC1000 / LPC2000 family
                   and Analog Devices ADUC70xx

Filename:          lpcprog.c

Compiler:          Microsoft VC 6/7, Microsoft VS2008, Microsoft VS2010,
                   GCC Cygwin, GCC Linux, GCC ARM ELF

Author:            Martin Maurer (Martin.Maurer@clibb.de)

Copyright:         (c) Martin Maurer 2003-2011, All rights reserved
Portions Copyright (c) by Aeolus Development 2004 http://www.aeolusdevelopment.com

    This file is part of lpc21isp.

    lpc21isp is free software: you can redistribute it and/or modify
    it under the terms of the GNU Lesser General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    any later version.

    lpc21isp is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public License
    and GNU General Public License along with lpc21isp.
    If not, see <http://www.gnu.org/licenses/>.
*/

// This file is for the Actual Programming of the LPC Chips

#if defined(_WIN32)
#if !defined __BORLANDC__
#include "StdAfx.h"
#endif
#endif // defined(_WIN32)
#include "lpc21isp.h"

#ifdef LPC_SUPPORT
#include "lpcprog.h"

static const unsigned int SectorTable_210x[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192,
    8192, 8192, 8192, 8192, 8192, 8192, 8192
};

static const unsigned int SectorTable_2103[] =
{
    4096, 4096, 4096, 4096, 4096, 4096, 4096, 4096
};

static const unsigned int SectorTable_2109[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192
};

static const unsigned int SectorTable_211x[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192,
    8192, 8192, 8192, 8192, 8192, 8192, 8192,
};

static const unsigned int SectorTable_212x[] =
{
    8192, 8192, 8192, 8192, 8192, 8192, 8192, 8192,
    65536, 65536, 8192, 8192, 8192, 8192, 8192, 8192, 8192
};

// Used for devices with 500K (LPC2138 and LPC2148) and
// for devices with 504K (1 extra 4k block at the end)
static const unsigned int SectorTable_213x[] =
{
     4096,  4096,  4096,  4096,  4096,  4096,  4096,  4096,
    32768, 32768, 32768, 32768, 32768, 32768, 32768, 32768,
    32768, 32768, 32768, 32768, 32768, 32768,  4096,  4096,
     4096,  4096,  4096,  4096
};

// Used for LPC17xx devices
static const unsigned int SectorTable_17xx[] =
{
     4096,  4096,  4096,  4096,  4096,  4096,  4096,  4096,
     4096,  4096,  4096,  4096,  4096,  4096,  4096,  4096,
    32768, 32768, 32768, 32768, 32768, 32768, 32768, 32768,
    32768, 32768, 32768, 32768, 32768, 32768
};

// Used for LPC1857 devices
static const unsigned int SectorTable_1857[] =
{
     8192,  8192,  8192,  8192,  8192,  8192,  8192,  8192,
    65536, 65536, 65536, 65536, 65536, 65536, 65536,
     8192,  8192,  8192,  8192,  8192,  8192,  8192,  8192,
    65536, 65536, 65536, 65536, 65536, 65536, 65536
};

// Used for LPC4357 devices
static const unsigned int SectorTable_4357[] =
{
     8192,  8192,  8192,  8192,  8192,  8192,  8192,  8192,
    65536, 65536, 65536, 65536, 65536, 65536, 65536,
     8192,  8192,  8192,  8192,  8192,  8192,  8192,  8192,
    65536, 65536, 65536, 65536, 65536, 65536, 65536
};

// Used for LPC8xx devices
static const unsigned int SectorTable_8xx[] =
{
     1024,  1024,  1024,  1024,  1024,  1024,  1024,  1024,
     1024,  1024,  1024,  1024,  1024,  1024,  1024,  1024
};

static int unsigned SectorTable_RAM[]  = { 65000 };

static LPC_DEVICE_TYPE LPCtypes[] =
{
   { 0, 0, 0, 0, 0, 0, 0, CHIP_VARIANT_NONE },  /* unknown */

   // id, name of product, flash size, ram size, total number of sector, max copy size, sector table, chip variant

   { 0x00008100, "810M021FN8",     4,   1,  4,  512, SectorTable_8xx,  CHIP_VARIANT_LPC8XX  },
   { 0x00008110, "811M001FDH16",   8,   2,  8, 1024, SectorTable_8xx,  CHIP_VARIANT_LPC8XX  },
   { 0x00008120, "812M101FDH16",  16,   4, 16, 1024, SectorTable_8xx,  CHIP_VARIANT_LPC8XX  },
   { 0x00008121, "812M101FD20",   16,   4, 16, 1024, SectorTable_8xx,  CHIP_VARIANT_LPC8XX  },
   { 0x00008122, "812M101FDH20",  16,   4, 16, 1024, SectorTable_8xx,  CHIP_VARIANT_LPC8XX  },

   { 0x2500102B, "1102",          32,   8,  8, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },

   { 0x0A07102B, "1110.../002",    4,   1,  1, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x1A07102B, "1110.../002",    4,   1,  1, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0A16D02B, "1111.../002",    8,   2,  2, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x1A16D02B, "1111.../002",    8,   2,  2, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x041E502B, "1111.../101",    8,   2,  2, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2516D02B, "1111.../102",    8,   2,  2, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0416502B, "1111.../201",    8,   4,  2, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2516902B, "1111.../202",    8,   4,  2, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x042D502B, "1112.../101",   16,   2,  4, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2524D02B, "1112.../102",   16,   2,  4, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0A24902B, "1112.../102",   16,   4,  4, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x1A24902B, "1112.../102",   16,   4,  4, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0425502B, "1112.../201",   16,   4,  4, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2524902B, "1112.../202",   16,   4,  4, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0434502B, "1113.../201",   24,   4,  6, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2532902B, "1113.../202",   24,   4,  6, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0434102B, "1113.../301",   24,   8,  6, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2532102B, "1113.../302",   24,   8,  6, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0A40902B, "1114.../102",   32,   4,  8, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x1A40902B, "1114.../102",   32,   4,  8, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0444502B, "1114.../201",   32,   4,  8, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2540902B, "1114.../202",   32,   4,  8, 1024, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x0444102B, "1114.../301",   32,   8,  8, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x2540102B, "1114.../302",   32,   8,  8, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },

   { 0x00040042, "1114.../203",   32,   8,  8, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x00040040, "1114.../303",   32,   8,  8, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x00040060, "1114.../323",   32,   8,  8, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x00040070, "1114.../333",   32,   8,  8, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },
   { 0x00050080, "1115.../303",   64,   8, 16, 4096, SectorTable_17xx, CHIP_VARIANT_LPC11XX },

