StefanSpa/lpc21isp/lpcprog.c
#if defined INTEGRATED_IN_WIN_APP
                        // inform the calling application about having written another chuck of data
                        AppWritten(45);
#endif

                        // Uuencode one 45 byte block
                        tmpStringPos = 0;

#if !defined COMPILE_FOR_LPC21
                        sendbuf[Line][tmpStringPos++] = (char)(' ' + 45);    // Encode Length of block
#else
                        tmpString[tmpStringPos++] = (char)(' ' + 45);        // Encode Length of block
#endif

                        for (BlockOffset = 0; BlockOffset < 45; BlockOffset++)
                        {
                            if (IspEnvironment->BinaryOffset < ReturnValueLpcRamStart(IspEnvironment))
                            { // Flash: use full memory
                                c = IspEnvironment->BinaryContent[Pos + Block * 45 + BlockOffset];
                            }
                            else
                            { // RAM: Skip first 0x200 bytes, these are used by the download program in LPC21xx
                                c = IspEnvironment->BinaryContent[Pos + Block * 45 + BlockOffset + 0x200];
                            }

                            block_CRC += c;

                            k = (k << 8) + (c & 255);

                            if ((BlockOffset % 3) == 2)   // Collecting always 3 Bytes, then do processing in 4 Bytes
                            {
#if !defined COMPILE_FOR_LPC21
                                sendbuf[Line][tmpStringPos++] = uuencode_table[(k >> 18) & 63];
                                sendbuf[Line][tmpStringPos++] = uuencode_table[(k >> 12) & 63];
                                sendbuf[Line][tmpStringPos++] = uuencode_table[(k >>  6) & 63];
                                sendbuf[Line][tmpStringPos++] = uuencode_table[ k        & 63];
#else
                                tmpString[tmpStringPos++] = uuencode_table[(k >> 18) & 63];
                                tmpString[tmpStringPos++] = uuencode_table[(k >> 12) & 63];
                                tmpString[tmpStringPos++] = uuencode_table[(k >>  6) & 63];
                                tmpString[tmpStringPos++] = uuencode_table[ k        & 63];
#endif
                            }
                        }


#if !defined COMPILE_FOR_LPC21
                        sendbuf[Line][tmpStringPos++] = '\n';
                        sendbuf[Line][tmpStringPos++] = 0;

                        SendComPort(IspEnvironment, sendbuf[Line]);
                        // receive only for debug purposes
                        ReceiveComPort(IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 1,5000);
#else
                        tmpString[tmpStringPos++] = '\n';
                        tmpString[tmpStringPos++] = 0;

                        SendComPort(IspEnvironment, tmpString);
                        ReceiveComPort(IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 1,5000);
                        if (strncmp(Answer, tmpString, tmpStringPos) != 0)
                        {
                            DebugPrintf(1, "Error on writing data (1)\n");
                            return (ERROR_WRITE_DATA);
                        }
#endif

                        Line++;

                        DebugPrintf(3, "Line = %d\n", Line);

                        if (Line == 20)
                        {
#if !defined COMPILE_FOR_LPC21
                            for (repeat = 0; repeat < 3; repeat++)
                            {

                                // printf("block_CRC = %ld\n", block_CRC);

                                sprintf(tmpString, "%ld\n", block_CRC);

                                SendComPort(IspEnvironment, tmpString);

                                ReceiveComPort(IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2,5000);

                                sprintf(tmpString, "%ld\nOK\r\n", block_CRC);

                                printf("\n\n\nAnswer:%s\ntmpString:%s\n\n\n", Answer, tmpString);

                                if (strcmp(Answer, tmpString) != 0)
                                {
                                    for (i = 0; i < Line; i++)
                                    {
                                        SendComPort(IspEnvironment, sendbuf[i]);
                                        ReceiveComPort(IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 1,5000);
                                    }
                                }
                                else
                                    break;
                            }

                            if (repeat >= 3)
                            {
                                DebugPrintf(1, "Error on writing block_CRC (1)\n");
                                return (ERROR_WRITE_CRC);
                            }
#else
                            // printf("block_CRC = %ld\n", block_CRC);
                            sprintf(tmpString, "%ld\r\n", block_CRC);
                            SendComPort(IspEnvironment, tmpString);

                            ReceiveComPort(IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2,5000);

                            sprintf(tmpString, "%ld\r\nOK\r\n", block_CRC);
                            if (strcmp(Answer, tmpString) != 0)
                            {
                                DebugPrintf(1, "Error on writing block_CRC (2)\n");
                                return (ERROR_WRITE_CRC);
                            }
#endif
                            Line = 0;
                            block_CRC = 0;
                        }
                    }
                }

                if (Line != 0)
                {
#if !defined COMPILE_FOR_LPC21
                    for (repeat = 0; repeat < 3; repeat++)
                    {
                        sprintf(tmpString, "%ld\n", block_CRC);

                        SendComPort(IspEnvironment, tmpString);

                        ReceiveComPort(IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2,5000);

                        sprintf(tmpString, "%ld\nOK\r\n", block_CRC);

